SnapBloks/SnapBloks/stm32/boards.txt
menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.opt=Optimize

menu.upload_method=Upload method

################################################################################

SnapBloksLED.name=SnapBloks LED

SnapBloksLED.build.core=STM32:arduino
SnapBloksLED.build.board=SnapBloksLED
SnapBloksLED.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED=SB072-LED-RED
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.upload.maximum_size=65536
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.upload.maximum_data_size=16384
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.mcu=cortex-m0
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.board=SB072_LED_RED
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.series=STM32F0xx
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.product_line=STM32F072xB
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.variant=SB072_LED_RED
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_RED.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW=SB072-LED-YELLOW
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.upload.maximum_size=65536
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.upload.maximum_data_size=16384
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.mcu=cortex-m0
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.board=SB072_LED_YELLOW
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.series=STM32F0xx
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.product_line=STM32F072xB
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.variant=SB072_LED_YELLOW
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_YELLOW.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN=SB072-LED-GREEN
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.upload.maximum_size=65536
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.upload.maximum_data_size=16384
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.mcu=cortex-m0
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.board=SB072_LED_GREEN
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.series=STM32F0xx
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.product_line=STM32F072xB
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.variant=SB072_LED_GREEN
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.cmsis_lib_gcc=arm_cortexM0l_math
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.startup_file=-DCUSTOM_STARTUP_FILE
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.bootloader_flags=-DVARIANT_SUPPORT_SOFTDFU
SnapBloksLED.menu.pnum.SNAPBLOKS_LED_GREEN.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC

SnapBloksLED.menu.xserial.generic=Enabled (generic 'Serial')
SnapBloksLED.menu.xserial.none=Enabled (no generic 'Serial')
SnapBloksLED.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
SnapBloksLED.menu.xserial.disabled=Disabled (no Serial support)
SnapBloksLED.menu.xserial.disabled.build.xSerial=

SnapBloksLED.menu.usb.none=None
SnapBloksLED.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
SnapBloksLED.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
SnapBloksLED.menu.usb.CDC=CDC (no generic 'Serial')
SnapBloksLED.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
SnapBloksLED.menu.usb.HID=HID (keyboard and mouse)
SnapBloksLED.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE

SnapBloksLED.menu.xusb.FS=Low/Full Speed
SnapBloksLED.menu.xusb.HS=High Speed
SnapBloksLED.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
SnapBloksLED.menu.xusb.HSFS=High Speed in Full Speed mode
SnapBloksLED.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

SnapBloksLED.menu.opt.osstd=Smallest (-Os default)
SnapBloksLED.menu.opt.oslto=Smallest (-Os) with LTO
SnapBloksLED.menu.opt.oslto.build.flags.optimize=-Os -flto
SnapBloksLED.menu.opt.o1std=Fast (-O1)
SnapBloksLED.menu.opt.o1std.build.flags.optimize=-O1
SnapBloksLED.menu.opt.o1lto=Fast (-O1) with LTO
SnapBloksLED.menu.opt.o1lto.build.flags.optimize=-O1 -flto
SnapBloksLED.menu.opt.o2std=Faster (-O2)
SnapBloksLED.menu.opt.o2std.build.flags.optimize=-O2
SnapBloksLED.menu.opt.o2lto=Faster (-O2) with LTO
SnapBloksLED.menu.opt.o2lto.build.flags.optimize=-O2 -flto
SnapBloksLED.menu.opt.o3std=Fastest (-O3)
SnapBloksLED.menu.opt.o3std.build.flags.optimize=-O3
SnapBloksLED.menu.opt.o3lto=Fastest (-O3) with LTO
SnapBloksLED.menu.opt.o3lto.build.flags.optimize=-O3 -flto
SnapBloksLED.menu.opt.ogstd=Debug (-g)
SnapBloksLED.menu.opt.ogstd.build.flags.optimize=-g -Og

SnapBloksLED.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
SnapBloksLED.menu.upload_method.swdMethod.upload.protocol=0
SnapBloksLED.menu.upload_method.swdMethod.upload.options=-g
SnapBloksLED.menu.upload_method.swdMethod.upload.tool=STM32:stm32CubeProg

SnapBloksLED.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
SnapBloksLED.menu.upload_method.dfuMethod.upload.protocol=2
SnapBloksLED.menu.upload_method.dfuMethod.upload.options=-g
SnapBloksLED.menu.upload_method.dfuMethod.upload.tool=STM32:stm32CubeProg

SnapBloksLED.menu.upload_method.dfusMethod=Soft-DFU Upload
SnapBloksLED.menu.upload_method.dfusMethod.upload.protocol=softdfu
SnapBloksLED.menu.upload_method.dfusMethod.upload.tool=softdfu_upload
SnapBloksLED.menu.upload_method.dfusMethod.upload.usbID=0483:df11
SnapBloksLED.menu.upload_method.dfusMethod.upload.altID=0